app/controllers/spaceships_controller.rb

  def index
    @spaceships = Spaceship.all
---
SELECT * FROM "spaceships"

  def show
    @spaceship = Spaceship.find(params[:id])
---
SELECT * FROM "spaceships" WHERE ("spaceships"."id" = 1)

  def create
    @spaceship = Spaceship.new(params[:spaceship])
    if @spaceship.save
---
INSERT INTO "spaceships" ("name", "ship_class", "created_at", "photo_file_size", "weapons", "updated_at", "photo_file_name", "number_of_crew_members", "photo_content_type", "flight_plans", "photo_updated_at", "purpose") VALUES('Star Destroyer', NULL, '2011-06-10 06:59:52', 50198, 'MANY!', '2011-06-10 06:59:52', 'StarDestroyer.jpg', 0, 'image/jpeg', 'Attack the rebel scum!', '2011-06-10 06:59:51', 'To DESTROY!')